SunSunSun-23413011/RX231_Mouse3/trash/2026-02-07-12-58-08/src/smc_gen/r_datfrx_rx/src/flash_type_1/r_dm_1.c
#endif /* (FLASH_DM_CFG_DF_BLOCK_NUM == 31) */
#endif /* (FLASH_DM_CFG_DF_BLOCK_NUM == 30) */
#endif /* (FLASH_DM_CFG_DF_BLOCK_NUM == 29) */
#endif /* (FLASH_DM_CFG_DF_BLOCK_NUM == 28) */
#endif /* (FLASH_DM_CFG_DF_BLOCK_NUM == 27) */
#endif /* (FLASH_DM_CFG_DF_BLOCK_NUM == 26) */
#endif /* (FLASH_DM_CFG_DF_BLOCK_NUM == 25) */
#endif /* (FLASH_DM_CFG_DF_BLOCK_NUM == 24) */
#endif /* (FLASH_DM_CFG_DF_BLOCK_NUM == 23) */
#endif /* (FLASH_DM_CFG_DF_BLOCK_NUM == 22) */
#endif /* (FLASH_DM_CFG_DF_BLOCK_NUM == 21) */
#endif /* (FLASH_DM_CFG_DF_BLOCK_NUM == 20) */
#endif /* (FLASH_DM_CFG_DF_BLOCK_NUM == 19) */
#endif /* (FLASH_DM_CFG_DF_BLOCK_NUM == 18) */
#endif /* (FLASH_DM_CFG_DF_BLOCK_NUM == 17) */
#endif /* (FLASH_DM_CFG_DF_BLOCK_NUM == 16) */
#endif /* (FLASH_DM_CFG_DF_BLOCK_NUM == 15) */
#endif /* (FLASH_DM_CFG_DF_BLOCK_NUM == 14) */
#endif /* (FLASH_DM_CFG_DF_BLOCK_NUM == 13) */
#endif /* (FLASH_DM_CFG_DF_BLOCK_NUM == 12) */
#endif /* (FLASH_DM_CFG_DF_BLOCK_NUM == 11) */
#endif /* (FLASH_DM_CFG_DF_BLOCK_NUM == 10) */
#endif /* (FLASH_DM_CFG_DF_BLOCK_NUM == 9) */
#endif /* (FLASH_DM_CFG_DF_BLOCK_NUM == 8) */
#endif /* (FLASH_DM_CFG_DF_BLOCK_NUM == 7) */
#endif /* (FLASH_DM_CFG_DF_BLOCK_NUM == 6) */
#endif /* (FLASH_DM_CFG_DF_BLOCK_NUM == 5) */
#endif /* (FLASH_DM_CFG_DF_BLOCK_NUM == 4) */
#endif /* (FLASH_DM_CFG_DF_BLOCK_NUM == 3) */
#endif /* (FLASH_DM_CFG_DF_BLOCK_NUM == 2) */
};

/* Number of blocks which data flash driver uses */
const uint8_t g_flash_dm_block_num = (uint8_t)(FLASH_DM_CFG_DF_BLOCK_NUM);

/* Data size of each id */
const uint16_t gc_dm_data_size[] =
{
    FLASH_DM_CFG_DF_SIZE_NO0,   FLASH_DM_CFG_DF_SIZE_NO1,   FLASH_DM_CFG_DF_SIZE_NO2,   FLASH_DM_CFG_DF_SIZE_NO3,
    FLASH_DM_CFG_DF_SIZE_NO4,   FLASH_DM_CFG_DF_SIZE_NO5,   FLASH_DM_CFG_DF_SIZE_NO6,   FLASH_DM_CFG_DF_SIZE_NO7,
    FLASH_DM_CFG_DF_SIZE_NO8,   FLASH_DM_CFG_DF_SIZE_NO9,   FLASH_DM_CFG_DF_SIZE_NO10,  FLASH_DM_CFG_DF_SIZE_NO11,
    FLASH_DM_CFG_DF_SIZE_NO12,  FLASH_DM_CFG_DF_SIZE_NO13,  FLASH_DM_CFG_DF_SIZE_NO14,  FLASH_DM_CFG_DF_SIZE_NO15,
    FLASH_DM_CFG_DF_SIZE_NO16,  FLASH_DM_CFG_DF_SIZE_NO17,  FLASH_DM_CFG_DF_SIZE_NO18,  FLASH_DM_CFG_DF_SIZE_NO19,
    FLASH_DM_CFG_DF_SIZE_NO20,  FLASH_DM_CFG_DF_SIZE_NO21,  FLASH_DM_CFG_DF_SIZE_NO22,  FLASH_DM_CFG_DF_SIZE_NO23,
    FLASH_DM_CFG_DF_SIZE_NO24,  FLASH_DM_CFG_DF_SIZE_NO25,  FLASH_DM_CFG_DF_SIZE_NO26,  FLASH_DM_CFG_DF_SIZE_NO27,
    FLASH_DM_CFG_DF_SIZE_NO28,  FLASH_DM_CFG_DF_SIZE_NO29,  FLASH_DM_CFG_DF_SIZE_NO30,  FLASH_DM_CFG_DF_SIZE_NO31,
    FLASH_DM_CFG_DF_SIZE_NO32,  FLASH_DM_CFG_DF_SIZE_NO33,  FLASH_DM_CFG_DF_SIZE_NO34,  FLASH_DM_CFG_DF_SIZE_NO35,
    FLASH_DM_CFG_DF_SIZE_NO36,  FLASH_DM_CFG_DF_SIZE_NO37,  FLASH_DM_CFG_DF_SIZE_NO38,  FLASH_DM_CFG_DF_SIZE_NO39,
    /*  FLASH_DM_CFG_DF_SIZE_NO40,  FLASH_DM_CFG_DF_SIZE_NO41,  FLASH_DM_CFG_DF_SIZE_NO42,  FLASH_DM_CFG_DF_SIZE_NO43, */
    /*  FLASH_DM_CFG_DF_SIZE_NO44,  FLASH_DM_CFG_DF_SIZE_NO45,  FLASH_DM_CFG_DF_SIZE_NO46,  FLASH_DM_CFG_DF_SIZE_NO47, */
    /*  FLASH_DM_CFG_DF_SIZE_NO48,  FLASH_DM_CFG_DF_SIZE_NO49,  FLASH_DM_CFG_DF_SIZE_NO50,  FLASH_DM_CFG_DF_SIZE_NO51, */
    /*  FLASH_DM_CFG_DF_SIZE_NO52,  FLASH_DM_CFG_DF_SIZE_NO53,  FLASH_DM_CFG_DF_SIZE_NO54,  FLASH_DM_CFG_DF_SIZE_NO55, */
    /*  FLASH_DM_CFG_DF_SIZE_NO56,  FLASH_DM_CFG_DF_SIZE_NO57,  FLASH_DM_CFG_DF_SIZE_NO58,  FLASH_DM_CFG_DF_SIZE_NO59, */
    /*  FLASH_DM_CFG_DF_SIZE_NO60,  FLASH_DM_CFG_DF_SIZE_NO61,  FLASH_DM_CFG_DF_SIZE_NO62,  FLASH_DM_CFG_DF_SIZE_NO63, */
    /*  FLASH_DM_CFG_DF_SIZE_NO64,  FLASH_DM_CFG_DF_SIZE_NO65,  FLASH_DM_CFG_DF_SIZE_NO66,  FLASH_DM_CFG_DF_SIZE_NO67, */
    /*  FLASH_DM_CFG_DF_SIZE_NO68,  FLASH_DM_CFG_DF_SIZE_NO69,  FLASH_DM_CFG_DF_SIZE_NO70,  FLASH_DM_CFG_DF_SIZE_NO71, */
    /*  FLASH_DM_CFG_DF_SIZE_NO72,  FLASH_DM_CFG_DF_SIZE_NO73,  FLASH_DM_CFG_DF_SIZE_NO74,  FLASH_DM_CFG_DF_SIZE_NO75, */
    /*  FLASH_DM_CFG_DF_SIZE_NO76,  FLASH_DM_CFG_DF_SIZE_NO77,  FLASH_DM_CFG_DF_SIZE_NO78,  FLASH_DM_CFG_DF_SIZE_NO79, */
    /*  FLASH_DM_CFG_DF_SIZE_NO80,  FLASH_DM_CFG_DF_SIZE_NO81,  FLASH_DM_CFG_DF_SIZE_NO82,  FLASH_DM_CFG_DF_SIZE_NO83, */
    /*  FLASH_DM_CFG_DF_SIZE_NO84,  FLASH_DM_CFG_DF_SIZE_NO85,  FLASH_DM_CFG_DF_SIZE_NO86,  FLASH_DM_CFG_DF_SIZE_NO87, */
    /*  FLASH_DM_CFG_DF_SIZE_NO88,  FLASH_DM_CFG_DF_SIZE_NO89,  FLASH_DM_CFG_DF_SIZE_NO90,  FLASH_DM_CFG_DF_SIZE_NO91, */
    /*  FLASH_DM_CFG_DF_SIZE_NO92,  FLASH_DM_CFG_DF_SIZE_NO93,  FLASH_DM_CFG_DF_SIZE_NO94,  FLASH_DM_CFG_DF_SIZE_NO95, */
    /*  FLASH_DM_CFG_DF_SIZE_NO96,  FLASH_DM_CFG_DF_SIZE_NO97,  FLASH_DM_CFG_DF_SIZE_NO98,  FLASH_DM_CFG_DF_SIZE_NO99, */
    /*  FLASH_DM_CFG_DF_SIZE_NO100, FLASH_DM_CFG_DF_SIZE_NO101, FLASH_DM_CFG_DF_SIZE_NO102, FLASH_DM_CFG_DF_SIZE_NO103, */
    /*  FLASH_DM_CFG_DF_SIZE_NO104, FLASH_DM_CFG_DF_SIZE_NO105, FLASH_DM_CFG_DF_SIZE_NO106, FLASH_DM_CFG_DF_SIZE_NO107, */
    /*  FLASH_DM_CFG_DF_SIZE_NO108, FLASH_DM_CFG_DF_SIZE_NO109, FLASH_DM_CFG_DF_SIZE_NO110, FLASH_DM_CFG_DF_SIZE_NO111, */
    /*  FLASH_DM_CFG_DF_SIZE_NO112, FLASH_DM_CFG_DF_SIZE_NO113, FLASH_DM_CFG_DF_SIZE_NO114, FLASH_DM_CFG_DF_SIZE_NO115, */
    /*  FLASH_DM_CFG_DF_SIZE_NO116, FLASH_DM_CFG_DF_SIZE_NO117, FLASH_DM_CFG_DF_SIZE_NO118, FLASH_DM_CFG_DF_SIZE_NO119, */
    /*  FLASH_DM_CFG_DF_SIZE_NO120, FLASH_DM_CFG_DF_SIZE_NO121, FLASH_DM_CFG_DF_SIZE_NO122, FLASH_DM_CFG_DF_SIZE_NO123, */
    /*  FLASH_DM_CFG_DF_SIZE_NO124, FLASH_DM_CFG_DF_SIZE_NO125, FLASH_DM_CFG_DF_SIZE_NO126, FLASH_DM_CFG_DF_SIZE_NO127, */
    /*  FLASH_DM_CFG_DF_SIZE_NO128, FLASH_DM_CFG_DF_SIZE_NO129, FLASH_DM_CFG_DF_SIZE_NO130, FLASH_DM_CFG_DF_SIZE_NO131, */
    /*  FLASH_DM_CFG_DF_SIZE_NO132, FLASH_DM_CFG_DF_SIZE_NO133, FLASH_DM_CFG_DF_SIZE_NO134, FLASH_DM_CFG_DF_SIZE_NO135, */
    /*  FLASH_DM_CFG_DF_SIZE_NO136, FLASH_DM_CFG_DF_SIZE_NO137, FLASH_DM_CFG_DF_SIZE_NO138, FLASH_DM_CFG_DF_SIZE_NO139, */
    /*  FLASH_DM_CFG_DF_SIZE_NO140, FLASH_DM_CFG_DF_SIZE_NO141, FLASH_DM_CFG_DF_SIZE_NO142, FLASH_DM_CFG_DF_SIZE_NO143, */
    /*  FLASH_DM_CFG_DF_SIZE_NO144, FLASH_DM_CFG_DF_SIZE_NO145, FLASH_DM_CFG_DF_SIZE_NO146, FLASH_DM_CFG_DF_SIZE_NO147, */
    /*  FLASH_DM_CFG_DF_SIZE_NO148, FLASH_DM_CFG_DF_SIZE_NO149, FLASH_DM_CFG_DF_SIZE_NO150, FLASH_DM_CFG_DF_SIZE_NO151, */
    /*  FLASH_DM_CFG_DF_SIZE_NO152, FLASH_DM_CFG_DF_SIZE_NO153, FLASH_DM_CFG_DF_SIZE_NO154, FLASH_DM_CFG_DF_SIZE_NO155, */
    /*  FLASH_DM_CFG_DF_SIZE_NO156, FLASH_DM_CFG_DF_SIZE_NO157, FLASH_DM_CFG_DF_SIZE_NO158, FLASH_DM_CFG_DF_SIZE_NO159, */
    /*  FLASH_DM_CFG_DF_SIZE_NO160, FLASH_DM_CFG_DF_SIZE_NO161, FLASH_DM_CFG_DF_SIZE_NO162, FLASH_DM_CFG_DF_SIZE_NO163, */
    /*  FLASH_DM_CFG_DF_SIZE_NO164, FLASH_DM_CFG_DF_SIZE_NO165, FLASH_DM_CFG_DF_SIZE_NO166, FLASH_DM_CFG_DF_SIZE_NO167, */
    /*  FLASH_DM_CFG_DF_SIZE_NO168, FLASH_DM_CFG_DF_SIZE_NO169, FLASH_DM_CFG_DF_SIZE_NO170, FLASH_DM_CFG_DF_SIZE_NO171, */
    /*  FLASH_DM_CFG_DF_SIZE_NO172, FLASH_DM_CFG_DF_SIZE_NO173, FLASH_DM_CFG_DF_SIZE_NO174, FLASH_DM_CFG_DF_SIZE_NO175, */
    /*  FLASH_DM_CFG_DF_SIZE_NO176, FLASH_DM_CFG_DF_SIZE_NO177, FLASH_DM_CFG_DF_SIZE_NO178, FLASH_DM_CFG_DF_SIZE_NO179, */
    /*  FLASH_DM_CFG_DF_SIZE_NO180, FLASH_DM_CFG_DF_SIZE_NO181, FLASH_DM_CFG_DF_SIZE_NO182, FLASH_DM_CFG_DF_SIZE_NO183, */
    /*  FLASH_DM_CFG_DF_SIZE_NO184, FLASH_DM_CFG_DF_SIZE_NO185, FLASH_DM_CFG_DF_SIZE_NO186, FLASH_DM_CFG_DF_SIZE_NO187, */
    /*  FLASH_DM_CFG_DF_SIZE_NO188, FLASH_DM_CFG_DF_SIZE_NO189, FLASH_DM_CFG_DF_SIZE_NO190, FLASH_DM_CFG_DF_SIZE_NO191, */
    /*  FLASH_DM_CFG_DF_SIZE_NO192, FLASH_DM_CFG_DF_SIZE_NO193, FLASH_DM_CFG_DF_SIZE_NO194, FLASH_DM_CFG_DF_SIZE_NO195, */
    /*  FLASH_DM_CFG_DF_SIZE_NO196, FLASH_DM_CFG_DF_SIZE_NO197, FLASH_DM_CFG_DF_SIZE_NO198, FLASH_DM_CFG_DF_SIZE_NO199, */
    /*  FLASH_DM_CFG_DF_SIZE_NO200, FLASH_DM_CFG_DF_SIZE_NO201, FLASH_DM_CFG_DF_SIZE_NO202, FLASH_DM_CFG_DF_SIZE_NO203, */
    /*  FLASH_DM_CFG_DF_SIZE_NO204, FLASH_DM_CFG_DF_SIZE_NO205, FLASH_DM_CFG_DF_SIZE_NO206, FLASH_DM_CFG_DF_SIZE_NO207, */
    /*  FLASH_DM_CFG_DF_SIZE_NO208, FLASH_DM_CFG_DF_SIZE_NO209, FLASH_DM_CFG_DF_SIZE_NO210, FLASH_DM_CFG_DF_SIZE_NO211, */
    /*  FLASH_DM_CFG_DF_SIZE_NO212, FLASH_DM_CFG_DF_SIZE_NO213, FLASH_DM_CFG_DF_SIZE_NO214, FLASH_DM_CFG_DF_SIZE_NO215, */
    /*  FLASH_DM_CFG_DF_SIZE_NO216, FLASH_DM_CFG_DF_SIZE_NO217, FLASH_DM_CFG_DF_SIZE_NO218, FLASH_DM_CFG_DF_SIZE_NO219, */
    /*  FLASH_DM_CFG_DF_SIZE_NO220, FLASH_DM_CFG_DF_SIZE_NO221, FLASH_DM_CFG_DF_SIZE_NO222, FLASH_DM_CFG_DF_SIZE_NO223, */
    /*  FLASH_DM_CFG_DF_SIZE_NO224, FLASH_DM_CFG_DF_SIZE_NO225, FLASH_DM_CFG_DF_SIZE_NO226, FLASH_DM_CFG_DF_SIZE_NO227, */
    /*  FLASH_DM_CFG_DF_SIZE_NO228, FLASH_DM_CFG_DF_SIZE_NO229, FLASH_DM_CFG_DF_SIZE_NO230, FLASH_DM_CFG_DF_SIZE_NO231, */
    /*  FLASH_DM_CFG_DF_SIZE_NO232, FLASH_DM_CFG_DF_SIZE_NO233, FLASH_DM_CFG_DF_SIZE_NO234, FLASH_DM_CFG_DF_SIZE_NO235, */
    /*  FLASH_DM_CFG_DF_SIZE_NO236, FLASH_DM_CFG_DF_SIZE_NO237, FLASH_DM_CFG_DF_SIZE_NO238, FLASH_DM_CFG_DF_SIZE_NO239, */
    /*  FLASH_DM_CFG_DF_SIZE_NO240, FLASH_DM_CFG_DF_SIZE_NO241, FLASH_DM_CFG_DF_SIZE_NO242, FLASH_DM_CFG_DF_SIZE_NO243, */
    /*  FLASH_DM_CFG_DF_SIZE_NO244, FLASH_DM_CFG_DF_SIZE_NO245, FLASH_DM_CFG_DF_SIZE_NO246, FLASH_DM_CFG_DF_SIZE_NO247, */
    /*  FLASH_DM_CFG_DF_SIZE_NO248, FLASH_DM_CFG_DF_SIZE_NO249, FLASH_DM_CFG_DF_SIZE_NO250, FLASH_DM_CFG_DF_SIZE_NO251, */
    /*  FLASH_DM_CFG_DF_SIZE_NO252, FLASH_DM_CFG_DF_SIZE_NO253, FLASH_DM_CFG_DF_SIZE_NO254  */
};

/* Number of id of data flash which driver handles */
const flash_dm_t g_r_flash_dm_block_erase_flag[FLASH_DM_BH_ERASE_FLAG_INDEX] =
{0xaa, 0xaa, 0xaa, 0xaa, 0xaa, 0xaa, 0xaa, 0xaa};

/************************************************************************************************
* Function Name: r_flash_dm_drvif_open
* Description  : Opens the driver interface.
* Arguments    : None
* Return Value : 1: Successful operation
*              : 0: Error
*------------------------------------------------------------------------------------------------
* Notes        : If control the code flash, must place the source code to the ROM.
*              : (Prohibit the placement to RAM)
*************************************************************************************************/
uint8_t r_flash_dm_drvif_open(void)
{
    if (R_FLASH_Open() != FLASH_SUCCESS)
    {
        return 0;
    }

    flash_interrupt_config_t cb_func_info;
    /* Set callback function and interrupt priority
       if use BGO of the Code Flash or the Data Flash. */
    cb_func_info.pcallback    = r_flash_dm_drvif_callback;
    cb_func_info.int_priority = FLASH_DM_CFG_FRDYI_INT_PRIORITY;
    /* cast from &flash_interrupt_config_t to void* */
    if (R_FLASH_Control(FLASH_CMD_SET_BGO_CALLBACK, (void *)&cb_func_info) != FLASH_SUCCESS)
    {
        return 0;
    }

    return 1;
} /* End of function r_flash_dm_drvif_open() */

/************************************************************************************************
* Function Name: r_flash_dm_drvif_init_device
* Description  : Initializes the driver interface.
* Arguments    : None
* Return Value : 1: Successful operation
*------------------------------------------------------------------------------------------------
* Notes        : None
*************************************************************************************************/
uint8_t r_flash_dm_drvif_init_device(void)
{
    return 1;
} /* End of function r_flash_dm_drvif_init_device() */

/************************************************************************************************
* Function Name: r_flash_dm_drvif_erase_error
* Description  : Checks the erase error.
* Arguments    : None
* Return Value : 1: Successful operation
*              : 0: Error
*------------------------------------------------------------------------------------------------
* Notes        : None
*************************************************************************************************/
uint8_t r_flash_dm_drvif_erase_error(void)
{
    if (1 == g_flash_dm_err_flg)
    {
        g_flash_dm_err_flg = 0;
        return 0;
    }
    return 1;
} /* End of function r_flash_dm_drvif_erase_error() */

/************************************************************************************************
* Function Name: r_flash_dm_drvif_program_error
* Description  : Checks the program error.
* Arguments    : None
* Return Value : 1: Successful operation
*              : 0: Error
*------------------------------------------------------------------------------------------------
* Notes        : None
*************************************************************************************************/
uint8_t r_flash_dm_drvif_program_error(void)
{
    if (1 == g_flash_dm_err_flg)
    {
        g_flash_dm_err_flg = 0;
        return 0;
    }
    return 1;
} /* End of function r_flash_dm_drvif_program_error() */

/************************************************************************************************
* Function Name: r_flash_dm_drvif_overwrite_block_flag
* Description  : Overwrites the block flag.
* Arguments    : flash_dm_ptr_t     p_addr      ; Overwrite address
* Return Value : 1: Successful operation
*              : 0: Error
*------------------------------------------------------------------------------------------------
* Notes        : None
*************************************************************************************************/
uint8_t r_flash_dm_drvif_overwrite_block_flag(flash_dm_ptr_t p_addr)
{
    uint8_t ret = 1;
    flash_dm_ptr_t p = p_addr;
    /* cast from uint8_t to uint8_t */
    if (FLASH_DM_BH_FLAG_FF == p[1])
    {
        /* cast from uint8_t to uint8_t */
        ret = r_flash_dm_drvif_overwrite(&p[1], FLASH_DM_BH_FLAG_00);
    }
    return ret;
} /* End of function r_flash_dm_drvif_overwrite_block_flag() */

/************************************************************************************************
* Function Name: r_flash_dm_drvif_get_block_num
* Description  : Gets the number of the block.
* Arguments    : None
* Return Value : The number of the block
*------------------------------------------------------------------------------------------------
* Notes        : None
*************************************************************************************************/
uint8_t r_flash_dm_drvif_get_block_num(void)
{
    return g_flash_dm_block_num;
} /* End of function r_flash_dm_drvif_get_block_num() */

/************************************************************************************************
* Function Name: r_flash_dm_drvif_get_block_info
* Description  : Gets the information of the block.
* Arguments    : uint8_t    index   ; The block no.
* Return Value : Pointer to the information of the block
*------------------------------------------------------------------------------------------------
* Notes        : None
*************************************************************************************************/
flash_dm_block_ptr_t r_flash_dm_drvif_get_block_info(uint8_t index)
{
    return &gs_flash_dm_block_info[index];
} /* End of function r_flash_dm_drvif_get_block_info() */

/************************************************************************************************
* Function Name: r_flash_dm_drvif_get_block_addr
* Description  : Gets the address of the block.
* Arguments    : uint8_t    index   ; The block no.
* Return Value : Pinter to the address of the block
*------------------------------------------------------------------------------------------------
* Notes        : None
*************************************************************************************************/
flash_dm_ptr_t r_flash_dm_drvif_get_block_addr(uint8_t index)
{
    return g_r_flash_dm_block_addr[index];
} /* End of function r_flash_dm_drvif_get_block_addr() */

/************************************************************************************************
* Function Name: r_flash_dm_drvif_set_addr_h
* Description  : If controls the code flash, sets the upper address of the block.
* Arguments    : st_flash_dispatch_1_hndl_t * p_hndl   ; FLASH DM information
* Return Value : None
*------------------------------------------------------------------------------------------------
* Notes        : None
*************************************************************************************************/
void r_flash_dm_drvif_set_addr_h(st_flash_dispatch_1_hndl_t * p_hndl)
{
    /* Do nothing */
} /* End of function r_flash_dm_drvif_set_addr_h() */

/************************************************************************************************
* Function Name: r_flash_dm_drvif_get_addr
* Description  : Gets the lower address of the block.
* Arguments    : st_flash_dm_dh_t * p_dh_hndl  ; FLASH DM data header information
* Return Value : The lower address of the block
*------------------------------------------------------------------------------------------------
* Notes        : None
*************************************************************************************************/
uint32_t r_flash_dm_drvif_get_addr(flash_dm_dh_ptr_t p_dh_hndl)
{
    /* cast from uint16_t to uint32_t */
    return (FLASH_DM_ADDR_MASK | p_dh_hndl->addr);
} /* End of function r_flash_dm_drvif_get_addr() */

/************************************************************************************************
* Function Name: r_flash_dm_drvif_get_block_erase_flag
* Description  : Gets block_erase_flag.
* Arguments    : None
* Return Value : Pointer of block_erase_flag
*------------------------------------------------------------------------------------------------
* Notes        : None
*************************************************************************************************/
flash_dm_ptr_t r_flash_dm_drvif_get_block_erase_flag(void)
{
    /* cast from uint8_t to flash_dm_ptr_t */
    return (flash_dm_ptr_t)&g_r_flash_dm_block_erase_flag[0];
} /* End of function r_flash_dm_drvif_get_block_erase_flag() */

/************************************************************************************************
* Function Name: r_flash_dm_drvif_set_dh_flag
* Description  : Sets data header_flag.
* Arguments    : flash_dm_t * p_flag    ; Pointer to the header flag
*              : flash_dm_t data        ; data
* Return Value : None
*------------------------------------------------------------------------------------------------
* Notes        : None
*************************************************************************************************/
void r_flash_dm_drvif_set_dh_flag(flash_dm_t * p_flag, flash_dm_t data)
{
    /* cast from uint8_t to uint8_t */
    *p_flag++ = FLASH_DM_DH_EXIST_FLAG;
} /* End of function r_flash_dm_drvif_set_dh_flag() */

/************************************************************************************************
* Function Name: r_flash_dm_drvif_overwrite
* Description  : Overwrites the block flag and busy wait.
* Arguments    : flash_dm_ptr_t     p_addr  ; Pointer to the overwrite address
*              : flash_dm_t         value   ; Overwrite value
* Return Value : 1: Successful operation
*              : 0: Error
*------------------------------------------------------------------------------------------------
* Notes        : If control the code flash, place the source code to the RAM.
*************************************************************************************************/
static uint8_t r_flash_dm_drvif_overwrite(flash_dm_ptr_t p_addr, flash_dm_t value)
{
    flash_err_t ret = FLASH_SUCCESS;
    uint32_t loop_cnt = FLASH_DM_BUSY_WAIT;     /* Wait = (1ms * FLASH_DM_BUSY_WAIT) */
    uint8_t  index = 0;
    flash_dm_t buf[FLASH_DM_PRG_BUF_INDEX];

    /* WAIT_LOOP */
    for (index = 0; index < FLASH_DM_PRG_BUF_INDEX; index++)
    {
        buf[index] = value;
    }

    if (r_flash_dm_drvif_write(p_addr, &buf[0]) == FLASH_DM_ERR)
    {
        return 0;
    }

    /* WAIT_LOOP */
    do
    {
        ret = R_FLASH_Control(FLASH_CMD_STATUS_GET, NULL);
        if (FLASH_SUCCESS == ret)
        {
            return 1;
        }
        else if (FLASH_ERR_BUSY != ret)
        {
            break;
        }
        else
        {
            /* Busy */
        }

        if (true != r_flash_dm_softwaredelay(1, FLASH_DM_DELAY_MILLISECS))  /* 1ms */
        {
            break;
        }
        loop_cnt--;
    }
    while (0 != loop_cnt);

