SunSunSun-23413011/RX231_Mouse3/trash/2026-02-07-12-58-08/src/smc_gen/r_datfrx_rx/src/flash_type_1/r_dm_1.c
    /* If data is 0xff, omit the program. */
    /* WAIT_LOOP */
    while ((gs_flash_dm_b_counter > 0) &&
            /* cast from uint8_t to uint8_t */
            (((flash_dm_t)FLASH_DM_DH_FLAG_FF) == (*g_flash_dispatch_1_hndl->flash_dm_a_src)))
    {
        g_flash_dispatch_1_hndl->flash_dm_a_addr++;
        gs_flash_dm_b_counter--;
        g_flash_dispatch_1_hndl->flash_dm_a_src++;
    }

    /* Check to finish program. */
    if (0 == gs_flash_dm_b_counter)
    {
        return 0;
    }
    /* WAIT_LOOP */
    for (index = 0; index < FLASH_DM_PRG_BUF_INDEX; index++)
    {
        gs_flash_dm_b_data[index] = *g_flash_dispatch_1_hndl->flash_dm_a_src++;
    }

    /* cast from flash_dm_ptr_t to uint32_t */
    g_flash_dispatch_1_hndl->flash_dm_a_src = (flash_dm_ptr_t)((uint32_t)g_flash_dispatch_1_hndl->flash_dm_a_src -
            /* cast from flash_dm_t to uint32_t */
            (uint32_t)(sizeof(flash_dm_t) * FLASH_DM_PRG_BUF_INDEX));

    if (gs_flash_dm_b_counter > gs_flash_dm_transfer_unit)
    {
        gs_flash_dm_b_unit = gs_flash_dm_transfer_unit;
    }
    else
    {
        /* cast from uint16_t to uint8_t */
        gs_flash_dm_b_unit = (uint8_t)gs_flash_dm_b_counter;
    }
    return 1;
} /* End of function r_flash_dm_block_copy_setup() */

/************************************************************************************************
* Function Name: r_flash_dm_block_fill_setup
* Description  : Checks program completion and update the address and counter of program.
* Arguments    : None
* Return Value : 1: Not finish program and update program data.
*              : 0: Finish program
*------------------------------------------------------------------------------------------------
* Notes        : None
*************************************************************************************************/
static uint8_t r_flash_dm_block_fill_setup(void)
{
    /* WAIT_LOOP */
    while ((gs_flash_dm_b_counter > 0) &&
            /* cast from uint8_t to uint8_t */
            ((FLASH_DM_DH_FLAG_FF != (*g_flash_dispatch_1_hndl->flash_dm_a_addr)) &&
             (0 != gs_flash_dm_b_data[0])))
    {
        g_flash_dispatch_1_hndl->flash_dm_a_addr++;
        gs_flash_dm_b_counter--;
    }

    /* Check to finish program. */
    if (0 == gs_flash_dm_b_counter)
    {
        return 0;
    }
    gs_flash_dm_b_unit = gs_flash_dm_transfer_unit;

    return 1;
} /* End of function r_flash_dm_block_fill_setup() */

/************************************************************************************************
* Function Name: r_flash_dm_block_program_setup
* Description  : Sets block program.
* Arguments    : None
* Return Value : FLASH_DM_TRUE  : Not finish program and set program data.
*              : FLASH_DM_FALSE : Finish program
*------------------------------------------------------------------------------------------------
* Notes        : None
*************************************************************************************************/
static e_flash_dm_state_t r_flash_dm_block_program_setup(void)
{
    uint8_t ret = 0;

    if (gs_flash_dm_b_counter > 0)
    {
        if (0 != g_flash_dispatch_1_hndl->flash_dm_a_src)
        {
            ret = r_flash_dm_block_copy_setup();
        }
        else
        {
            ret = r_flash_dm_block_fill_setup();
        }
    }

    if (1 == ret)
    {
        return FLASH_DM_TRUE;
    }
    else
    {
        return FLASH_DM_FALSE;
    }
} /* End of function r_flash_dm_block_program_setup() */

/************************************************************************************************
* Function Name: r_flash_dm_block_program_check
* Description  : Checks program.
* Arguments    : None
* Return Value : FLASH_DM_PROGRAM_CHECK_END     ; Successful program operation
*              : FLASH_DM_PROGRAM_ERROR         ; Program error
*------------------------------------------------------------------------------------------------
* Notes        : None
*************************************************************************************************/
e_flash_dm_state_t r_flash_dm_block_program_check(void)
{
    uint8_t index = 0;

    if (!r_flash_dm_drvif_program_error())
    {
        return FLASH_DM_PROGRAM_ERROR;
    }
    else
    {
        gs_flash_dm_b_counter -= gs_flash_dm_b_unit;
        /* cast from uint32_t to flash_dm_ptr_t */
        g_flash_dispatch_1_hndl->flash_dm_a_addr = (flash_dm_ptr_t)((uint32_t)g_flash_dispatch_1_hndl->flash_dm_a_addr + (uint32_t)gs_flash_dm_b_unit);

        if (0 != g_flash_dispatch_1_hndl->flash_dm_a_src)
        {
            /* cast from uint32_t to flash_dm_ptr_t */
            g_flash_dispatch_1_hndl->flash_dm_a_src = (flash_dm_ptr_t)((uint32_t)g_flash_dispatch_1_hndl->flash_dm_a_src + (uint32_t)gs_flash_dm_b_unit);
            /* WAIT_LOOP */
            for (index = 0; index < FLASH_DM_PRG_BUF_INDEX; index++)
            {
                gs_flash_dm_b_data[index] = *g_flash_dispatch_1_hndl->flash_dm_a_src++;
            }
            /* cast from uint32_t to flash_dm_ptr_t */
            g_flash_dispatch_1_hndl->flash_dm_a_src = (flash_dm_ptr_t)((uint32_t)g_flash_dispatch_1_hndl->flash_dm_a_src -
                    /* cast from flash_dm_t to uint32_t */
                    (uint32_t)(sizeof(flash_dm_t) * FLASH_DM_PRG_BUF_INDEX));
        }
    }
    return FLASH_DM_PROGRAM_CHECK_END;
} /* End of function r_flash_dm_block_program_check() */

/************************************************************************************************
* Function Name: r_flash_dm_block_erase_check
* Description  : Checks erase.
* Arguments    : None
* Return Value : FLASH_DM_ERASE_END     ; Successful erase operation
*              : FLASH_DM_ERASE_ERROR   ; Erase error
*------------------------------------------------------------------------------------------------
* Notes        : None
*************************************************************************************************/
e_flash_dm_state_t r_flash_dm_block_erase_check(void)
{
    if (!r_flash_dm_drvif_erase_error())
    {
        return FLASH_DM_ERASE_ERROR;
    }
    return FLASH_DM_ERASE_END;
} /* End of function r_flash_dm_block_erase_check() */

/************************************************************************************************
* Function Name: r_flash_dm_block_command
* Description  : Issues the program command or erase command.
* Arguments    : st_flash_dispatch_1_hndl_t * p_hndl   ; FLASH DM information
* Return Value : FLASH_DM_PROGRAM_END       ; Finish program
*              : FLASH_DM_COMMAND_END       ; Finish to issue the command
*              : FLASH_DM_COMMAND_FALSE     ; Error
*------------------------------------------------------------------------------------------------
* Notes        : None
*************************************************************************************************/
e_flash_dm_state_t r_flash_dm_block_command(st_flash_dispatch_1_hndl_t * p_hndl)
{
    /* cast from uint8_t to uint8_t */
    if (FLASH_DM_MODE_PROGRAM == gs_flash_dm_c_mode)
    {
        if (r_flash_dm_block_program_setup() == FLASH_DM_FALSE)
        {
            return FLASH_DM_PROGRAM_END;
        }

        if (r_flash_dm_drvif_write(g_flash_dispatch_1_hndl->flash_dm_a_addr, &gs_flash_dm_b_data[0]) == FLASH_DM_ERR)
        {
            return FLASH_DM_COMMAND_FALSE;
        }
    }
    /* cast from uint8_t to uint8_t */
    else if (FLASH_DM_MODE_ERASE == gs_flash_dm_c_mode)
    {
        if (r_flash_dm_drvif_erase(g_flash_dispatch_1_hndl->flash_dm_a_addr) == FLASH_DM_ERR)
        {
            return FLASH_DM_COMMAND_FALSE;
        }
    }
    else
    {
        return FLASH_DM_COMMAND_FALSE;
    }
    return FLASH_DM_COMMAND_END;
} /* End of function r_flash_dm_block_command() */

/************************************************************************************************
* Function Name: r_flash_dm_drvif_callback
* Description  : Executes call back function.
* Arguments    : void * event ; Pointer to the event
* Return Value : None
*------------------------------------------------------------------------------------------------
* Notes        : None
*************************************************************************************************/
void r_flash_dm_drvif_callback(void * event)
{
    flash_int_cb_args_t *ready_event = event;

